#### Terraform Format and Style 🖌`success`
#### staging - Terraform Initialization ⚙️`success`
#### staging - Terraform Validation 🤖Success! The configuration is valid.


#### staging - Terraform Plan 📖`success`

<details><summary>staging - Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo"]: Refreshing state... [id=qyJhMAwOBt5d1-lvgRv9GA]
module.datarepo-app.module.cloudsql.random_id.app_user_password["datarepo-stairway"]: Refreshing state... [id=KPftzftWN3wzfpr-sscW4Q]
module.datarepo-app.module.cloudsql.random_id.cloudsql_id[0]: Refreshing state... [id=Q0c_L6KXhSQ]
module.datarepo-app.module.cloudsql.random_id.root_user_password[0]: Refreshing state... [id=e4_Gm8FYOX0obHjHwLHlCA]
module.core-infrastructure.module.k8s-master.data.google_container_engine_versions.cluster_versions: Refreshing state... [id=2020-12-08 15:23:16.477699786 +0000 UTC]
module.enable-services.google_project_service.cloudresourcemanager[0]: Refreshing state... [id=terra-datarepo-staging/cloudresourcemanager.googleapis.com]
module.core-infrastructure.module.k8s-master.data.google_project.project: Refreshing state... [id=projects/terra-datarepo-staging]
module.core-infrastructure.google_compute_ssl_policy.global-ssl-policy: Refreshing state... [id=projects/terra-datarepo-staging/global/sslPolicies/global-ssl-policy]
module.enable-services.google_project_service.serviceusage[0]: Refreshing state... [id=terra-datarepo-staging/serviceusage.googleapis.com]
module.core-infrastructure.module.cloud-armor.google_compute_security_policy.policy: Refreshing state... [id=projects/terra-datarepo-staging/global/securityPolicies/broad-cloud-armor]
module.enable-services.google_project_service.required-services[12]: Refreshing state... [id=terra-datarepo-staging/storage-component.googleapis.com]
module.enable-services.google_project_service.required-services[15]: Refreshing state... [id=terra-datarepo-staging/logging.googleapis.com]
module.enable-services.google_project_service.required-services[7]: Refreshing state... [id=terra-datarepo-staging/sql-component.googleapis.com]
module.enable-services.google_project_service.required-services[2]: Refreshing state... [id=terra-datarepo-staging/serviceusage.googleapis.com]
module.enable-services.google_project_service.required-services[8]: Refreshing state... [id=terra-datarepo-staging/monitoring.googleapis.com]
module.enable-services.google_project_service.required-services[0]: Refreshing state... [id=terra-datarepo-staging/iamcredentials.googleapis.com]
module.enable-services.google_project_service.required-services[13]: Refreshing state... [id=terra-datarepo-staging/servicenetworking.googleapis.com]
module.enable-services.google_project_service.required-services[3]: Refreshing state... [id=terra-datarepo-staging/genomics.googleapis.com]
module.enable-services.google_project_service.required-services[1]: Refreshing state... [id=terra-datarepo-staging/cloudresourcemanager.googleapis.com]
module.enable-services.google_project_service.required-services[11]: Refreshing state... [id=terra-datarepo-staging/storage-api.googleapis.com]
module.enable-services.google_project_service.required-services[14]: Refreshing state... [id=terra-datarepo-staging/stackdriver.googleapis.com]
module.enable-services.google_project_service.required-services[5]: Refreshing state... [id=terra-datarepo-staging/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[10]: Refreshing state... [id=terra-datarepo-staging/container.googleapis.com]
module.enable-services.google_project_service.required-services[6]: Refreshing state... [id=terra-datarepo-staging/dns.googleapis.com]
module.enable-services.google_project_service.required-services[9]: Refreshing state... [id=terra-datarepo-staging/sqladmin.googleapis.com]
module.enable-services.google_project_service.required-services[4]: Refreshing state... [id=terra-datarepo-staging/compute.googleapis.com]
module.core-infrastructure.google_compute_network.network[0]: Refreshing state... [id=projects/terra-datarepo-staging/global/networks/staging-network]
module.core-infrastructure.google_compute_address.nat-address[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/addresses/nat-external-0]
module.core-infrastructure.google_compute_address.nat-address[1]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/addresses/nat-external-1]
module.core-infrastructure.google_compute_subnetwork.subnetwork[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/subnetworks/staging-subnet]
module.core-infrastructure.google_compute_router.router[0]: Refreshing state... [id=projects/terra-datarepo-staging/regions/us-central1/routers/router]
module.core-infrastructure.module.k8s-master.google_container_cluster.cluster: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1]
module.core-infrastructure.google_compute_router_nat.nat[0]: Refreshing state... [id=terra-datarepo-staging/us-central1/router/nat-1]
module.core-infrastructure.module.k8s-nodes["jade-node-us-central-1"].google_container_node_pool.pool: Refreshing state... [id=projects/terra-datarepo-staging/locations/us-central1/clusters/jade-master-us-central1/nodePools/jade-node-us-central-1]
module.datarepo-app.module.workloadid.google_service_account.user-sql-service-account["staging"]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/staging-workload-proxy-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account.datarepo_test_runner_sa[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_compute_global_address.global_ip_address: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/jade-staging-ip]
module.datarepo-app.google_service_account.datarepo_sql_sa[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-sql@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.module.cloudsql.google_compute_global_address.private_ip_address[0]: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-db-jade-private-address]
module.datarepo-app.google_service_account.datarepo_api_sa[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[0]: Refreshing state... [id=terra-datarepo-staging/roles/container.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.test_runner_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com/keys/0887caee2ddf39743deb11b52b0ff2612be81c09]
module.datarepo-app.module.workloadid.google_project_iam_member.user-sql-sa-role["staging"]: Refreshing state... [id=terra-datarepo-staging/roles/cloudsql.client/serviceaccount:staging-workload-proxy-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[2]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.module.workloadid.google_service_account_iam_binding.sqlproxy_workload_identity_binding["staging"]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/staging-workload-proxy-sa@terra-datarepo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[3]: Refreshing state... [id=terra-datarepo-staging/roles/secretmanager.admin/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.test_runner_sa_role[1]: Refreshing state... [id=terra-datarepo-staging/roles/logging.viewer/serviceaccount:datarepo-jade-test-runner@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.sql_sa_role[0]: Refreshing state... [id=terra-datarepo-staging/roles/cloudsql.client/serviceaccount:datarepo-jade-sql@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[4]: Refreshing state... [id=terra-datarepo-staging/roles/logging.logWriter/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.api_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com/keys/9e3958203a25bd4cb03fea74b66428505693dcc3]
module.datarepo-app.google_project_iam_member.api_sa_role[3]: Refreshing state... [id=terra-datarepo-staging/roles/errorreporting.writer/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[5]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[11]: Refreshing state... [id=terra-datarepo-staging/roles/resourcemanager.projectIamAdmin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[1]: Refreshing state... [id=terra-datarepo-staging/roles/cloudsql.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[6]: Refreshing state... [id=terra-datarepo-staging/roles/servicemanagement.serviceController/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[8]: Refreshing state... [id=terra-datarepo-staging/roles/storage.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[0]: Refreshing state... [id=terra-datarepo-staging/roles/bigquery.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[9]: Refreshing state... [id=terra-datarepo-staging/roles/pubsub.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[2]: Refreshing state... [id=terra-datarepo-staging/roles/datastore.user/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[7]: Refreshing state... [id=terra-datarepo-staging/roles/stackdriver.accounts.viewer/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_project_iam_member.api_sa_role[10]: Refreshing state... [id=terra-datarepo-staging/roles/container.admin/serviceaccount:datarepo-jade-api@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-app.google_service_account_key.sql_sa_key[0]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/datarepo-jade-sql@terra-datarepo-staging.iam.gserviceaccount.com/keys/c093a924a22049c48e8257a30d1705e6796ce8c3]
module.datarepo-app.module.workloadid.google_service_account_key.user-sql-sa-key["staging"]: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/staging-workload-proxy-sa@terra-datarepo-staging.iam.gserviceaccount.com/keys/2d399dd32a96f830401f9900d153741e152d2a31]
module.datarepo-app.module.cloudsql.google_service_networking_connection.private_vpc_connection[0]: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Fterra-datarepo-staging%2Fglobal%2Fnetworks%2Fstaging-network:servicenetworking.googleapis.com]
module.datarepo-app.vault_generic_secret.test_runner_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/staging/test-runner-sa]
module.datarepo-app.vault_generic_secret.api_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/staging/datarepo-api-sa]
module.datarepo-app.vault_generic_secret.sql_sa_key[0]: Refreshing state... [id=secret/dsde/datarepo/staging/datarepo-sql-sa]
module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0]: Refreshing state... [id=datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo-stairway"]: Refreshing state... [id=drmanager//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo"]: Refreshing state... [id=projects/terra-datarepo-staging/instances/datarepo-db-jade-43473f2fa2978524/databases/datarepo]
module.datarepo-app.module.cloudsql.google_sql_user.root_user[0]: Refreshing state... [id=root//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.module.cloudsql.google_sql_database.app_database["datarepo-stairway"]: Refreshing state... [id=projects/terra-datarepo-staging/instances/datarepo-db-jade-43473f2fa2978524/databases/stairway]
module.datarepo-app.module.cloudsql.google_sql_user.app_user["datarepo"]: Refreshing state... [id=drmanager//datarepo-db-jade-43473f2fa2978524]
module.datarepo-app.vault_generic_secret.sql_db_password[0]: Refreshing state... [id=secret/dsde/datarepo/staging/datarepo-sql-db]
module.datarepo-alerts.data.vault_generic_secret.slack_token: Refreshing state... [id=secret/suitable/terraform/stackdriver/slack-token]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account.service-account: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.google_compute_global_address.global_ip_address_grafana: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-grafana-ip]
module.datarepo-alerts.google_compute_global_address.global_ip_address_prometheus: Refreshing state... [id=projects/terra-datarepo-staging/global/addresses/datarepo-prometheus-ip]
module.datarepo-alerts.module.uptimecheck.google_monitoring_uptime_check_config.uptime-check-config[0]: Refreshing state... [id=projects/terra-datarepo-staging/uptimeCheckConfigs/data-staging-envs-terra-bio]
module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0]: Refreshing state... [id=projects/terra-datarepo-staging/notificationChannels/18199841202267095917]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.metricWriter"]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.metricWriter/serviceaccount:prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/logging.admin"]: Refreshing state... [id=terra-datarepo-staging/roles/logging.admin/serviceaccount:prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_key.service-account-key: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com/keys/c2f010a444f648afa3b4678f0628510ad2c49f9c]
module.datarepo-alerts.module.prometheus_workloadid.google_service_account_iam_binding.workload-identity-binding: Refreshing state... [id=projects/terra-datarepo-staging/serviceAccounts/prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com/roles/iam.workloadIdentityUser]
module.datarepo-alerts.module.prometheus_workloadid.google_project_iam_member.service-account-role["roles/monitoring.admin"]: Refreshing state... [id=terra-datarepo-staging/roles/monitoring.admin/serviceaccount:prometheus-sa@terra-datarepo-staging.iam.gserviceaccount.com]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.node_resource_alerts: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/16184180379069024206]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_health_alert: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/8989025042201786625]
module.datarepo-alerts.module.k8s-cluster-alerts.google_monitoring_alert_policy.pod_memory_util: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/16776997133258105231]
module.datarepo-alerts.module.uptimecheck.google_monitoring_alert_policy.uptime-check[0]: Refreshing state... [id=projects/terra-datarepo-staging/alertPolicies/9790853949548877150]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      ~ data             = (sensitive value)
      ~ data_json        = (sensitive value)
      ~ id               = "secret/suitable/terraform/stackdriver/slack-token" -> (known after apply)
      ~ lease_duration   = 2764800 -> (known after apply)
      + lease_id         = (known after apply)
      ~ lease_renewable  = false -> (known after apply)
      ~ lease_start_time = "RFC1010109" -> (known after apply)
        path             = "secret/suitable/terraform/stackdriver/slack-token"
      - version          = -1 -> null
    }

  # module.datarepo-alerts.google_logging_metric.logging_metric_error_connections_exhausted will be created
  + resource "google_logging_metric" "logging_metric_error_connections_exhausted" {
      + filter  = <<~EOT
            resource.type="k8s_container"
            AND labels.k8s-pod/app_kubernetes_io/name="datarepo-api"
            AND resource.labels.project_id="terra-datarepo-staging"
            AND resource.labels.cluster_name="jade-master-us-central1"
            AND severity="ERROR"
            AND (jsonPayload.message:"Global exception handler" AND jsonPayload.message:"org.springframework.jdbc.CannotGetJdbcConnectionException")
        EOT
      + id      = (known after apply)
      + name    = "logging/user/metric_error_connections_exhausted"
      + project = (known after apply)

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # module.datarepo-alerts.google_monitoring_alert_policy.log_based_alert_policy will be created
  + resource "google_monitoring_alert_policy" "log_based_alert_policy" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Error was detected"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = [
          + "projects/terra-datarepo-staging/notificationChannels/18199841202267095917",
        ]
      + project               = "terra-datarepo-staging"

      + conditions {
          + display_name = "Connections Exhausted"
          + name         = (known after apply)

          + condition_threshold {
              + comparison = "COMPARISON_GT"
              + duration   = "60s"
              + filter     = "metric.type=\"logging/user/metric_error_connections_exhausted}\""

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_DELTA"
                }
            }
        }
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "staging"
        enabled      = true
        id           = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/terra-datarepo-staging/notificationChannels/18199841202267095917"
        project      = "terra-datarepo-staging"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        connection_name               = "terra-datarepo-staging:us-central1:datarepo-db-jade-43473f2fa2978524"
        database_version              = "POSTGRES_11"
        deletion_protection           = true
        first_ip_address              = "10.28.0.2"
        id                            = "datarepo-db-jade-43473f2fa2978524"
        ip_address                    = [
            {
                ip_address     = "10.28.0.2"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "datarepo-db-jade-43473f2fa2978524"
        private_ip_address            = "10.28.0.2"
        project                       = "terra-datarepo-staging"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/terra-datarepo-staging/instances/datarepo-db-jade-43473f2fa2978524"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQxN2Qw
                    NzUwYS1mZGNhLTQyYzAtOWFhZS1kMDdiYzZiY2VlMWExIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNzI5MjEwMTUxWhcNMzAwNzI3MjEwMjUxWjB3MS0wKwYD
                    VQQuEyQxN2QwNzUwYS1mZGNhLTQyYzAtOWFhZS1kMDdiYzZiY2VlMWExIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCb2D4PXXAo8Gy/uiFXxBMiSyk8hMK2JMGV8hbBKGG1gQBQ8oj6HsjNu+9wjzJE
                    2b9ZVNAtwWF0mP/cqCU6hoR/wQiakFp9B9uswh1gIkWY9ErAusisTnY0DdPU1NvH
                    SVzbsTIn3EsJWkNxPA8aNOa6A2VMdvUOvmLcbdn+7MJID5AY48g4qHoweEEdCCXG
                    B6MV27hM4MHPZ/JWsli8DpueA59G+uN6V0x8vWnPDxHDAkwS1LrJpjehWq8P24GJ
                    kL4hnFHQsfgW1DBrtJPWBLWZXEBiyplWwKUQLY90SXlsdyDyWQYXJoB7vG1Yxqyl
                    6YDAwQqBMEjkZKtglqUeFqbLAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAB+9HiUH3GbAg9bZN2Smkty2HzDYTG50Dr+fWUqs
                    RhFICBTE8uUSd/jsfBTYKmf+rgNnhzLGVWgvbf57dm58CnXGt7fpepoX4vFpxAf0
                    Yxtw7uyO7uSE6mcf0i9f5mgcrNdalIBoZX68wDN712Kobo5c073vWy+ghPFNrAvw
                    x0GpKljIQuCrOdBRH1l7mDtt6AzY4gxMsiR3yVTvNeJN0mxwtafYN9DksijiWFD2
                    Lr+h+gVL5WeMQ7gUwdINqDgwVuMkslNzJq/WSphkmjQu1wSonSBE/jk2Sbz9C95H
                    hkrs/EgiV9eYEKHyySXx6cryrJzqkQfPfmmOokYbOJLYTcY=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=17d0750a-fdca-42c0-9aae-d07bc6bcee1a"
                create_time      = "2020-07-29T21:01:51.696Z"
                expiration_time  = "2030-07-27T21:02:51.696Z"
                sha1_fingerprint = "aa9fa2d8d5a4a7a663eb3f27cce774ffdf8e79fc"
            },
        ]
        service_account_email_address = "p762196585894-wazwmo@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "REGIONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
          + replication_type            = "SYNCHRONOUS"
            tier                        = "db-custom-2-7680"
            user_labels                 = {
                "app" = "datarepo"
                "env" = "jade"
            }
            version                     = 30

            backup_configuration {
                binary_log_enabled             = false
                enabled                        = true
                point_in_time_recovery_enabled = false
                start_time                     = "06:00"
            }

            database_flags {
                name  = "max_connections"
                value = "200"
            }

            ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/terra-datarepo-staging/global/networks/staging-network"
                require_ssl     = true
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on modules/datarepo-app/cloudsql.tf line 25, in module "cloudsql":
  25:     "${local.service}" = {

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 5 more similar warnings elsewhere)


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @nmalfroy, Action: `pull_request`, Working Directory: `./datarepo`, Workflow: `Terraform Plan`*